{
    "irVersion": "1",
    "graph": {
        "node": [
            {
                "input": [
                    {
                        "name": "W_l2",
                        "type": "DATA_EDGE"
                    },
                    {
                        "name": "cst1",
                        "type": "DATA_EDGE"
                    }
                ],
                "name": "1",
                "opType": "Load",
                "scope": "Default/network-TrainStepWrap",
                "outputType": {
                    "dataType": "DT_TENSOR",
                    "tensorType": {
                        "elemType": "DT_FLOAT32",
                        "shape": {
                            "dim": [
                                {
                                    "size": "184965"
                                },
                                {
                                    "size": "1"
                                }
                            ]
                        }
                    }
                },
                "fullName": "W_l2"
            },
            {
                "name": "2",
                "opType": "GetNext",
                "scope": "Default",
                "attribute": [
                    {
                        "name": "visited",
                        "value": {
                            "dtype": "DT_BOOL",
                            "boolVal": true
                        }
                    },
                    {
                        "name": "IsFeatureMapInputList",
                        "value": {
                            "dtype": "DT_TUPLE"
                        }
                    },
                    {
                        "name": "stream_id",
                        "value": {
                            "dtype": "DT_UINT32",
                            "uintVal": "1"
                        }
                    },
                    {
                        "name": "IsFeatureMapOutput",
                        "value": {
                            "dtype": "DT_BOOL",
                            "boolVal": true
                        }
                    },
                    {
                        "name": "types",
                        "value": {
                            "dtype": "DT_LIST",
                            "values": [
                                {
                                    "dtype": "DT_TYPE",
                                    "typeVal": {
                                        "dataType": "DT_BASE_INT"
                                    }
                                },
                                {
                                    "dtype": "DT_TYPE",
                                    "typeVal": {
                                        "dataType": "DT_BASE_FLOAT"
                                    }
                                },
                                {
                                    "dtype": "DT_TYPE",
                                    "typeVal": {
                                        "dataType": "DT_BASE_FLOAT"
                                    }
                                }
                            ]
                        }
                    },
                    {
                        "name": "is_AICPU_kernel",
                        "value": {
                            "dtype": "DT_BOOL",
                            "boolVal": true
                        }
                    },
                    {
                        "name": "pri_format",
                        "value": {
                            "dtype": "DT_STRING",
                            "strVal": "NC1HWC0"
                        }
                    },
                    {
                        "name": "shapes",
                        "value": {
                            "dtype": "DT_LIST",
                            "values": [
                                {
                                    "dtype": "DT_LIST",
                                    "values": [
                                        {
                                            "dtype": "DT_INT64",
                                            "intVal": "16000"
                                        },
                                        {
                                            "dtype": "DT_INT64",
                                            "intVal": "39"
                                        }
                                    ]
                                },
                                {
                                    "dtype": "DT_LIST",
                                    "values": [
                                        {
                                            "dtype": "DT_INT64",
                                            "intVal": "16000"
                                        },
                                        {
                                            "dtype": "DT_INT64",
                                            "intVal": "39"
                                        }
                                    ]
                                },
                                {
                                    "dtype": "DT_LIST",
                                    "values": [
                                        {
                                            "dtype": "DT_INT64",
                                            "intVal": "16000"
                                        },
                                        {
                                            "dtype": "DT_INT64",
                                            "intVal": "1"
                                        }
                                    ]
                                }
                            ]
                        }
                    },
                    {
                        "name": "output_num",
                        "value": {
                            "dtype": "DT_INT64",
                            "intVal": "3"
                        }
                    },
                    {
                        "name": "shared_name",
                        "value": {
                            "dtype": "DT_STRING",
                            "strVal": "dc3c87cc-58b5-11ec-9e3a-c8c465f0edec"
                        }
                    }
                ],
                "outputType": {
                    "dataType": "DT_TUPLE",
                    "sequenceType": {
                        "elemTypes": [
                            {
                                "dataType": "DT_TENSOR",
                                "tensorType": {
                                    "elemType": "DT_INT32"
                                }
                            },
                            {
                                "dataType": "DT_TENSOR",
                                "tensorType": {
                                    "elemType": "DT_FLOAT32"
                                }
                            },
                            {
                                "dataType": "DT_TENSOR",
                                "tensorType": {
                                    "elemType": "DT_FLOAT32"
                                }
                            }
                        ]
                    }
                },
                "fullName": "Default/GetNext-op6"
            },
            {
                "input": [
                    {
                        "name": "2",
                        "type": "DATA_EDGE"
                    },
                    {
                        "name": "cst2",
                        "type": "DATA_EDGE"
                    }
                ],
                "name": "3",
                "opType": "TupleGetItem",
                "scope": "Default",
                "outputType": {
                    "dataType": "DT_TENSOR",
                    "tensorType": {
                        "elemType": "DT_INT32",
                        "shape": {
                            "dim": [
                                {
                                    "size": "16000"
                                },
                                {
                                    "size": "39"
                                }
                            ]
                        }
                    }
                },
                "fullName": "Default/TupleGetItem-op420"
            },
            {
                "input": [
                    {
                        "name": "3",
                        "type": "DATA_EDGE"
                    }
                ],
                "name": "4",
                "opType": "TensorMove",
                "scope": "Default",
                "attribute": [
                    {
                        "name": "visited",
                        "value": {
                            "dtype": "DT_BOOL",
                            "boolVal": true
                        }
                    },
                    {
                        "name": "pri_format",
                        "value": {
                            "dtype": "DT_STRING",
                            "strVal": "DefaultFormat"
                        }
                    },
                    {
                        "name": "label_for_insert_stream_active",
                        "value": {
                            "dtype": "DT_BOOL",
                            "boolVal": true
                        }
                    },
                    {
                        "name": "_datadump_original_names",
                        "value": {
                            "dtype": "DT_TUPLE"
                        }
                    },
                    {
                        "name": "IsFeatureMapInputList",
                        "value": {
                            "dtype": "DT_TUPLE",
                            "values": [
                                {
                                    "dtype": "DT_UINT64",
                                    "uintVal": "0"
                                }
                            ]
                        }
                    },
                    {
                        "name": "stream_id",
                        "value": {
                            "dtype": "DT_UINT32",
                            "uintVal": "3"
                        }
                    },
                    {
                        "name": "IsFeatureMapOutput",
                        "value": {
                            "dtype": "DT_BOOL",
                            "boolVal": true
                        }
                    }
                ],
                "outputType": {
                    "dataType": "DT_TENSOR",
                    "tensorType": {
                        "elemType": "DT_INT32",
                        "shape": {
                            "dim": [
                                {
                                    "size": "16000"
                                },
                                {
                                    "size": "39"
                                }
                            ]
                        }
                    }
                },
                "fullName": "Default/TensorMove-op272"
            },
            {
                "input": [
                    {
                        "name": "1",
                        "type": "DATA_EDGE"
                    },
                    {
                        "name": "4",
                        "type": "DATA_EDGE"
                    }
                ],
                "name": "5",
                "opType": "Gather",
                "scope": "Default/network-TrainStepWrap/network-NetWithLossClass/network-DeepFMModel",
                "attribute": [
                    {
                        "name": "visited",
                        "value": {
                            "dtype": "DT_BOOL",
                            "boolVal": true
                        }
                    },
                    {
                        "name": "pri_format",
                        "value": {
                            "dtype": "DT_STRING",
                            "strVal": "DefaultFormat"
                        }
                    },
                    {
                        "name": "axis",
                        "value": {
                            "dtype": "DT_INT64",
                            "intVal": "0"
                        }
                    },
                    {
                        "name": "IsFeatureMapInputList",
                        "value": {
                            "dtype": "DT_TUPLE",
                            "values": [
                                {
                                    "dtype": "DT_UINT64",
                                    "uintVal": "1"
                                }
                            ]
                        }
                    },
                    {
                        "name": "stream_id",
                        "value": {
                            "dtype": "DT_UINT32",
                            "uintVal": "3"
                        }
                    },
                    {
                        "name": "IsFeatureMapOutput",
                        "value": {
                            "dtype": "DT_BOOL",
                            "boolVal": true
                        }
                    },
                    {
                        "name": "input_names",
                        "value": {
                            "dtype": "DT_LIST",
                            "values": [
                                {
                                    "dtype": "DT_STRING",
                                    "strVal": "params"
                                },
                                {
                                    "dtype": "DT_STRING",
                                    "strVal": "indices"
                                },
                                {
                                    "dtype": "DT_STRING",
                                    "strVal": "axis"
                                }
                            ]
                        }
                    },
                    {
                        "name": "output_names",
                        "value": {
                            "dtype": "DT_LIST",
                            "values": [
                                {
                                    "dtype": "DT_STRING",
                                    "strVal": "output"
                                }
                            ]
                        }
                    }
                ],
                "outputType": {
                    "dataType": "DT_TENSOR",
                    "tensorType": {
                        "elemType": "DT_FLOAT32",
                        "shape": {
                            "dim": [
                                {
                                    "size": "16000"
                                },
                                {
                                    "size": "39"
                                },
                                {
                                    "size": "1"
                                }
                            ]
                        }
                    }
                },
                "fullName": "Default/network-TrainStepWrap/network-NetWithLossClass/network-DeepFMModel/Gather-op8"
            },
            {
                "input": [
                    {
                        "name": "2",
                        "type": "DATA_EDGE"
                    },
                    {
                        "name": "cst3",
                        "type": "DATA_EDGE"
                    }
                ],
                "name": "6",
                "opType": "TupleGetItem",
                "scope": "Default",
                "outputType": {
                    "dataType": "DT_TENSOR",
                    "tensorType": {
                        "elemType": "DT_FLOAT32",
                        "shape": {
                            "dim": [
                                {
                                    "size": "16000"
                                },
                                {
                                    "size": "39"
                                }
                            ]
                        }
                    }
                },
                "fullName": "Default/TupleGetItem-op421"
            },
            {
                "input": [
                    {
                        "name": "6",
                        "type": "DATA_EDGE"
                    }
                ],
                "name": "7",
                "opType": "TensorMove",
                "scope": "Default",
                "attribute": [
                    {
                        "name": "visited",
                        "value": {
                            "dtype": "DT_BOOL",
                            "boolVal": true
                        }
                    },
                    {
                        "name": "pri_format",
                        "value": {
                            "dtype": "DT_STRING",
                            "strVal": "DefaultFormat"
                        }
                    },
                    {
                        "name": "label_for_insert_stream_active",
                        "value": {
                            "dtype": "DT_BOOL",
                            "boolVal": true
                        }
                    },
                    {
                        "name": "_datadump_original_names",
                        "value": {
                            "dtype": "DT_TUPLE"
                        }
                    },
                    {
                        "name": "IsFeatureMapInputList",
                        "value": {
                            "dtype": "DT_TUPLE",
                            "values": [
                                {
                                    "dtype": "DT_UINT64",
                                    "uintVal": "0"
                                }
                            ]
                        }
                    },
                    {
                        "name": "stream_id",
                        "value": {
                            "dtype": "DT_UINT32",
                            "uintVal": "3"
                        }
                    },
                    {
                        "name": "IsFeatureMapOutput",
                        "value": {
                            "dtype": "DT_BOOL",
                            "boolVal": true
                        }
                    }
                ],
                "outputType": {
                    "dataType": "DT_TENSOR",
                    "tensorType": {
                        "elemType": "DT_FLOAT32",
                        "shape": {
                            "dim": [
                                {
                                    "size": "16000"
                                },
                                {
                                    "size": "39"
                                }
                            ]
                        }
                    }
                },
                "fullName": "Default/TensorMove-op274"
            },
            {
                "input": [
                    {
                        "name": "7",
                        "type": "DATA_EDGE"
                    }
                ],
                "name": "8",
                "opType": "Reshape",
                "scope": "Default/network-TrainStepWrap/network-NetWithLossClass/network-DeepFMModel",
                "attribute": [
                    {
                        "name": "visited",
                        "value": {
                            "dtype": "DT_BOOL",
                            "boolVal": true
                        }
                    },
                    {
                        "name": "is_AICPU_kernel",
                        "value": {
                            "dtype": "DT_BOOL",
                            "boolVal": true
                        }
                    },
                    {
                        "name": "pri_format",
                        "value": {
                            "dtype": "DT_STRING",
                            "strVal": "DefaultFormat"
                        }
                    },
                    {
                        "name": "shape",
                        "value": {
                            "dtype": "DT_TUPLE",
                            "values": [
                                {
                                    "dtype": "DT_INT64",
                                    "intVal": "16000"
                                },
                                {
                                    "dtype": "DT_INT64",
                                    "intVal": "39"
                                },
                                {
                                    "dtype": "DT_INT64",
                                    "intVal": "1"
                                }
                            ]
                        }
                    },
                    {
                        "name": "IsFeatureMapInputList",
                        "value": {
                            "dtype": "DT_TUPLE",
                            "values": [
                                {
                                    "dtype": "DT_UINT64",
                                    "uintVal": "0"
                                }
                            ]
                        }
                    },
                    {
                        "name": "IsFeatureMapOutput",
                        "value": {
                            "dtype": "DT_BOOL",
                            "boolVal": true
                        }
                    },
                    {
                        "name": "input_names",
                        "value": {
                            "dtype": "DT_LIST",
                            "values": [
                                {
                                    "dtype": "DT_STRING",
                                    "strVal": "tensor"
                                },
                                {
                                    "dtype": "DT_STRING",
                                    "strVal": "shape"
                                }
                            ]
                        }
                    },
                    {
                        "name": "output_names",
                        "value": {
                            "dtype": "DT_LIST",
                            "values": [
                                {
                                    "dtype": "DT_STRING",
                                    "strVal": "output"
                                }
                            ]
                        }
                    }
                ],
                "outputType": {
                    "dataType": "DT_TENSOR",
                    "tensorType": {
                        "elemType": "DT_FLOAT32",
                        "shape": {
                            "dim": [
                                {
                                    "size": "16000"
                                },
                                {
                                    "size": "39"
                                },
                                {
                                    "size": "1"
                                }
                            ]
                        }
                    }
                },
                "fullName": "Default/network-TrainStepWrap/network-NetWithLossClass/network-DeepFMModel/Reshape-op11"
            },
            {
                "input": [
                    {
                        "name": "5",
                        "type": "DATA_EDGE"
                    },
                    {
                        "name": "8",
                        "type": "DATA_EDGE"
                    }
                ],
                "name": "9",
                "opType": "Mul",
                "scope": "Default/network-TrainStepWrap/network-NetWithLossClass/network-DeepFMModel",
                "attribute": [
                    {
                        "name": "visited",
                        "value": {
                            "dtype": "DT_BOOL",
                            "boolVal": true
                        }
                    },
                    {
                        "name": "pri_format",
                        "value": {
                            "dtype": "DT_STRING",
                            "strVal": "DefaultFormat"
                        }
                    },
                    {
                        "name": "IsFeatureMapInputList",
                        "value": {
                            "dtype": "DT_TUPLE",
                            "values": [
                                {
                                    "dtype": "DT_UINT64",
                                    "uintVal": "0"
                                },
                                {
                                    "dtype": "DT_UINT64",
                                    "uintVal": "1"
                                }
                            ]
                        }
                    },
                    {
                        "name": "stream_id",
                        "value": {
                            "dtype": "DT_UINT32",
                            "uintVal": "3"
                        }
                    },
                    {
                        "name": "IsFeatureMapOutput",
                        "value": {
                            "dtype": "DT_BOOL",
                            "boolVal": true
                        }
                    },
                    {
                        "name": "input_names",
                        "value": {
                            "dtype": "DT_LIST",
                            "values": [
                                {
                                    "dtype": "DT_STRING",
                                    "strVal": "x"
                                },
                                {
                                    "dtype": "DT_STRING",
                                    "strVal": "y"
                                }
                            ]
                        }
                    },
                    {
                        "name": "output_names",
                        "value": {
                            "dtype": "DT_LIST",
                            "values": [
                                {
                                    "dtype": "DT_STRING",
                                    "strVal": "output"
                                }
                            ]
                        }
                    }
                ],
                "outputType": {
                    "dataType": "DT_TENSOR",
                    "tensorType": {
                        "elemType": "DT_FLOAT32",
                        "shape": {
                            "dim": [
                                {
                                    "size": "16000"
                                },
                                {
                                    "size": "39"
                                },
                                {
                                    "size": "1"
                                }
                            ]
                        }
                    }
                },
                "fullName": "Default/network-TrainStepWrap/network-NetWithLossClass/network-DeepFMModel/Mul-op9"
            },
            {
                "input": [
                    {
                        "name": "9",
                        "type": "DATA_EDGE"
                    }
                ],
                "name": "10",
                "opType": "ReduceSum",
                "scope": "Default/network-TrainStepWrap/network-NetWithLossClass/network-DeepFMModel",
                "attribute": [
                    {
                        "name": "visited",
                        "value": {
                            "dtype": "DT_BOOL",
                            "boolVal": true
                        }
                    },
                    {
                        "name": "pri_format",
                        "value": {
                            "dtype": "DT_STRING",
                            "strVal": "DefaultFormat"
                        }
                    },
                    {
                        "name": "axis",
                        "value": {
                            "dtype": "DT_TUPLE",
                            "values": [
                                {
                                    "dtype": "DT_INT64",
                                    "intVal": "1"
                                }
                            ]
                        }
                    },
                    {
                        "name": "IsFeatureMapInputList",
                        "value": {
                            "dtype": "DT_TUPLE",
                            "values": [
                                {
                                    "dtype": "DT_UINT64",
                                    "uintVal": "0"
                                }
                            ]
                        }
                    },
                    {
                        "name": "stream_id",
                        "value": {
                            "dtype": "DT_UINT32",
                            "uintVal": "3"
                        }
                    },
                    {
                        "name": "IsFeatureMapOutput",
                        "value": {
                            "dtype": "DT_BOOL",
                            "boolVal": true
                        }
                    },
                    {
                        "name": "keep_dims",
                        "value": {
                            "dtype": "DT_BOOL",
                            "boolVal": false
                        }
                    },
                    {
                        "name": "input_names",
                        "value": {
                            "dtype": "DT_LIST",
                            "values": [
                                {
                                    "dtype": "DT_STRING",
                                    "strVal": "input_x"
                                },
                                {
                                    "dtype": "DT_STRING",
                                    "strVal": "axis"
                                }
                            ]
                        }
                    },
                    {
                        "name": "output_names",
                        "value": {
                            "dtype": "DT_LIST",
                            "values": [
                                {
                                    "dtype": "DT_STRING",
                                    "strVal": "y"
                                }
                            ]
                        }
                    }
                ],
                "outputType": {
                    "dataType": "DT_TENSOR",
                    "tensorType": {
                        "elemType": "DT_FLOAT32",
                        "shape": {
                            "dim": [
                                {
                                    "size": "16000"
                                },
                                {
                                    "size": "1"
                                }
                            ]
                        }
                    }
                },
                "fullName": "Default/network-TrainStepWrap/network-NetWithLossClass/network-DeepFMModel/ReduceSum-op14"
            },
            {
                "input": [
                    {
                        "name": "V_l2",
                        "type": "DATA_EDGE"
                    },
                    {
                        "name": "cst1",
                        "type": "DATA_EDGE"
                    }
                ],
                "name": "11",
                "opType": "Load",
                "scope": "Default/network-TrainStepWrap",
                "outputType": {
                    "dataType": "DT_TENSOR",
                    "tensorType": {
                        "elemType": "DT_FLOAT32",
                        "shape": {
                            "dim": [
                                {
                                    "size": "184965"
                                },
                                {
                                    "size": "80"
                                }
                            ]
                        }
                    }
                },
                "fullName": "V_l2"
            },
            {
                "input": [
                    {
                        "name": "11",
                        "type": "DATA_EDGE"
                    },
                    {
                        "name": "4",
                        "type": "DATA_EDGE"
                    }
                ],
                "name": "12",
                "opType": "Gather",
                "scope": "Default/network-TrainStepWrap/network-NetWithLossClass/network-DeepFMModel",
                "attribute": [
                    {
                        "name": "visited",
                        "value": {
                            "dtype": "DT_BOOL",
                            "boolVal": true
                        }
                    },
                    {
                        "name": "pri_format",
                        "value": {
                            "dtype": "DT_STRING",
                            "strVal": "DefaultFormat"
                        }
                    },
                    {
                        "name": "axis",
                        "value": {
                            "dtype": "DT_INT64",
                            "intVal": "0"
                        }
                    },
                    {
                        "name": "IsFeatureMapInputList",
                        "value": {
                            "dtype": "DT_TUPLE",
                            "values": [
                                {
                                    "dtype": "DT_UINT64",
                                    "uintVal": "1"
                                }
                            ]
                        }
                    },
                    {
                        "name": "stream_id",
                        "value": {
                            "dtype": "DT_UINT32",
                            "uintVal": "3"
                        }
                    },
                    {
                        "name": "IsFeatureMapOutput",
                        "value": {
                            "dtype": "DT_BOOL",
                            "boolVal": true
                        }
                    },
                    {
                        "name": "input_names",
                        "value": {
                            "dtype": "DT_LIST",
                            "values": [
                                {
                                    "dtype": "DT_STRING",
                                    "strVal": "params"
                                },
                                {
                                    "dtype": "DT_STRING",
                                    "strVal": "indices"
                                },
                                {
                                    "dtype": "DT_STRING",
                                    "strVal": "axis"
                                }
                            ]
                        }
                    },
                    {
                        "name": "output_names",
                        "value": {
                            "dtype": "DT_LIST",
                            "values": [
                                {
                                    "dtype": "DT_STRING",
                                    "strVal": "output"
                                }
                            ]
                        }
                    }
                ],
                "outputType": {
                    "dataType": "DT_TENSOR",
                    "tensorType": {
                        "elemType": "DT_FLOAT32",
                        "shape": {
                            "dim": [
                                {
                                    "size": "16000"
                                },
                                {
                                    "size": "39"
                                },
                                {
                                    "size": "80"
                                }
                            ]
                        }
                    }
                },
                "fullName": "Default/network-TrainStepWrap/network-NetWithLossClass/network-DeepFMModel/Gather-op17"
            },
            {
                "input": [
                    {
                        "name": "12",
                        "type": "DATA_EDGE"
                    },
                    {
                        "name": "8",
                        "type": "DATA_EDGE"
                    }
                ],
                "name": "13",
                "opType": "Mul",
                "scope": "Default/network-TrainStepWrap/network-NetWithLossClass/network-DeepFMModel",
                "attribute": [
                    {
                        "name": "visited",
                        "value": {
                            "dtype": "DT_BOOL",
                            "boolVal": true
                        }
                    },
                    {
                        "name": "pri_format",
                        "value": {
                            "dtype": "DT_STRING",
                            "strVal": "DefaultFormat"
                        }
                    },
                    {
                        "name": "IsFeatureMapInputList",
                        "value": {
                            "dtype": "DT_TUPLE",
                            "values": [
                                {
                                    "dtype": "DT_UINT64",
                                    "uintVal": "0"
                                },
                                {
                                    "dtype": "DT_UINT64",
                                    "uintVal": "1"
                                }
                            ]
                        }
                    },
                    {
                        "name": "stream_id",
                        "value": {
                            "dtype": "DT_UINT32",
                            "uintVal": "3"
                        }
                    },
                    {
                        "name": "IsFeatureMapOutput",
                        "value": {
                            "dtype": "DT_BOOL",
                            "boolVal": true
                        }
                    },
                    {
                        "name": "input_names",
                        "value": {
                            "dtype": "DT_LIST",
                            "values": [
                                {
                                    "dtype": "DT_STRING",
                                    "strVal": "x"
                                },
                                {
                                    "dtype": "DT_STRING",
                                    "strVal": "y"
                                }
                            ]
                        }
                    },
                    {
                        "name": "output_names",
                        "value": {
                            "dtype": "DT_LIST",
                            "values": [
                                {
                                    "dtype": "DT_STRING",
                                    "strVal": "output"
                                }
                            ]
                        }
                    }
                ],
                "outputType": {
                    "dataType": "DT_TENSOR",
                    "tensorType": {
                        "elemType": "DT_FLOAT32",
                        "shape": {
                            "dim": [
                                {
                                    "size": "16000"
                                },
                                {
                                    "size": "39"
                                },
                                {
                                    "size": "80"
                                }
                            ]
                        }
                    }
                },
                "fullName": "Default/network-TrainStepWrap/network-NetWithLossClass/network-DeepFMModel/Mul-op13"
            },
            {
                "input": [
                    {
                        "name": "13",
                        "type": "DATA_EDGE"
                    }
                ],
                "name": "14",
                "opType": "ReduceSum",
                "scope": "Default/network-TrainStepWrap/network-NetWithLossClass/network-DeepFMModel",
                "attribute": [
                    {
                        "name": "visited",
                        "value": {
                            "dtype": "DT_BOOL",
                            "boolVal": true
                        }
                    },
                    {
                        "name": "pri_format",
                        "value": {
                            "dtype": "DT_STRING",
                            "strVal": "DefaultFormat"
                        }
                    },
                    {
                        "name": "axis",
                        "value": {
                            "dtype": "DT_TUPLE",
                            "values": [
                                {
                                    "dtype": "DT_INT64",
                                    "intVal": "1"
                                }
                            ]
                        }
                    },
                    {
                        "name": "IsFeatureMapInputList",
                        "value": {
                            "dtype": "DT_TUPLE",
                            "values": [
                                {
                                    "dtype": "DT_UINT64",
                                    "uintVal": "0"
                                }
                            ]
                        }
                    },
                    {
                        "name": "stream_id",
                        "value": {
                            "dtype": "DT_UINT32",
                            "uintVal": "3"
                        }
                    },
                    {
                        "name": "IsFeatureMapOutput",
                        "value": {
                            "dtype": "DT_BOOL",
                            "boolVal": true
                        }
                    },
                    {
                        "name": "keep_dims",
                        "value": {
                            "dtype": "DT_BOOL",
                            "boolVal": false
                        }
                    },
                    {
                        "name": "input_names",
                        "value": {
                            "dtype": "DT_LIST",
                            "values": [
                                {
                                    "dtype": "DT_STRING",
                                    "strVal": "input_x"
                                },
                                {
                                    "dtype": "DT_STRING",
                                    "strVal": "axis"
                                }
                            ]
                        }
                    },
                    {
                        "name": "output_names",
                        "value": {
                            "dtype": "DT_LIST",
                            "values": [
                                {
                                    "dtype": "DT_STRING",
                                    "strVal": "y"
                                }
                            ]
                        }
                    }
                ],
                "outputType": {
                    "dataType": "DT_TENSOR",
                    "tensorType": {
                        "elemType": "DT_FLOAT32",
                        "shape": {
                            "dim": [
                                {
                                    "size": "16000"
                                },
                                {
                                    "size": "80"
                                }
                            ]
                        }
                    }
                },
                "fullName": "Default/network-TrainStepWrap/network-NetWithLossClass/network-DeepFMModel/ReduceSum-op19"
            },
            {
                "input": [
                    {
                        "name": "14",
                        "type": "DATA_EDGE"
                    }
                ],
                "name": "15",
                "opType": "Square",
                "scope": "Default/network-TrainStepWrap/network-NetWithLossClass/network-DeepFMModel",
                "attribute": [
                    {
                        "name": "visited",
                        "value": {
                            "dtype": "DT_BOOL",
                            "boolVal": true
                        }
                    },
                    {
                        "name": "pri_format",
                        "value": {
                            "dtype": "DT_STRING",
                            "strVal": "DefaultFormat"
                        }
                    },
                    {
                        "name": "IsFeatureMapInputList",
                        "value": {
                            "dtype": "DT_TUPLE",
                            "values": [
                                {
                                    "dtype": "DT_UINT64",
                                    "uintVal": "0"
                                }
                            ]
                        }
                    },
                    {
                        "name": "stream_id",
                        "value": {
                            "dtype": "DT_UINT32",
                            "uintVal": "3"
                        }
                    },
                    {
                        "name": "IsFeatureMapOutput",
                        "value": {
                            "dtype": "DT_BOOL",
                            "boolVal": true
                        }
                    },
                    {
                        "name": "input_names",
                        "value": {
                            "dtype": "DT_LIST",
                            "values": [
                                {
                                    "dtype": "DT_STRING",
                                    "strVal": "input_x"
                                }
                            ]
                        }
                    },
                    {
                        "name": "output_names",
                        "value": {
                            "dtype": "DT_LIST",
                            "values": [
                                {
                                    "dtype": "DT_STRING",
                                    "strVal": "output"
                                }
                            ]
                        }
                    }
                ],
                "outputType": {
                    "dataType": "DT_TENSOR",
                    "tensorType": {
                        "elemType": "DT_FLOAT32",
                        "shape": {
                            "dim": [
                                {
                                    "size": "16000"
                                },
                                {
                                    "size": "80"
                                }
                            ]
                        }
                    }
                },
                "fullName": "Default/network-TrainStepWrap/network-NetWithLossClass/network-DeepFMModel/Square-op20"
            },
            {
